Если элемент не был найден за отведенное время, то мы получим NoSuchElementException.
Если элемент был найден в момент поиска, но при последующем обращении к элементу DOM изменился, 
то получим StaleElementReferenceException. 

Например, мы нашли элемент Кнопка и через какое-то время решили выполнить метод click. 
Если кнопка за это время была скрыта скриптом, то метод применять уже бесполезно — элемент "устарел" 
(stale) и мы увидим исключение.
Если элемент был найден в момент поиска, но сам элемент невидим (например, имеет нулевые размеры), 
и реальный пользователь не смог бы с ним взаимодействовать, то получим ElementNotVisibleException.
Знание причин появления исключений помогает отлаживать тесты и понимать, где находится баг.